## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.cinema-robusta is tainted, so must be replaced
-/+ resource "argocd_application" "cinema-robusta" {
!       id      = "robusta" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "robusta"
!           resource_version = "1976541" -> (known after apply)
!           uid              = "1266a1e1-a567-4aa6-862b-bdc9eb95bb63" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   value_files  = [] -> null
                    # (3 unchanged attributes hidden)

!                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
